docs.org
**** Playground
     targets:
     https://www.googleapis.com/auth/userinfo.email
     https://www.googleapis.com/auth/userinfo.profile

     https://accounts.google.com/o/oauth2/v2/auth?redirect_uri=https://developers.google.com/oauthplayground&prompt=consent&response_type=code&client_id=407408718192.apps.googleusercontent.com&scope=https://www.googleapis.com/auth/userinfo.email+https://www.googleapis.com/auth/userinfo.profile&access_type=offline
     send the returned token to the application to request a token
     request:
     #+BEGIN_SRC javascript
     // Request
     POST /oauth2/v4/token HTTP/1.1
     Host: www.googleapis.com
     Content-length: 277
     content-type: application/x-www-form-urlencoded
     user-agent: google-oauth-playground
     code=4%2FAAC8yZdfe98kiiX6R-lojj5Dqe4HHtGkDPMlaFobNBn1ai4aHpmRhpyZvD49xxsyHJaD5of_1zf50I7KyMZeXyk&redirect_uri=https%3A%2F%2Fdevelopers.google.com%2Foauthplayground&client_id=407408718192.apps.googleusercontent.com&client_secret=************&scope=&grant_type=authorization_code

     // Response
     HTTP/1.1 200 OK
     Content-length: 1389
     X-xss-protection: 1; mode=block
     X-content-type-options: nosniff
     Transfer-encoding: chunked
     Expires: Mon, 01 Jan 1990 00:00:00 GMT
     Vary: Origin, X-Origin
     Server: GSE
     -content-encoding: gzip
     Pragma: no-cache
     Cache-control: no-cache, no-store, max-age=0, must-revalidate
     Date: Sun, 22 Jul 2018 16:26:54 GMT
     X-frame-options: SAMEORIGIN
     Alt-svc: quic=":443"; ma=2592000; v="44,43,39,35"
     Content-type: application/json; charset=UTF-8
     {
       // This is unique to the application
       "access_token": "ya29.GlsABqo0h39HIGVZS3nJ_ZxU73fIfK929JGLXve2CCFJXv89HNyGY-tJZAONtfJCo1nktLYMXENSfvmZKhPehprQki1ZmluG6iHNTWwSEyHTg8NIfSmDavrH9hQd", 
       "token_type": "Bearer", 
       "expires_in": 3600, 
       "refresh_token": "1/w2Ix95nfsB8x7dc_og4PhtvqxKKs10t2LW4-xvoZmxU", 
       // This is unique to the user
       "id_token": "eyJhbGciOiJSUzI1NiIsImtpZCI6ImM2YWY3Y2FhMDg5NWZkMDFlNzc4ZGNlYWE3YTc5ODgzNDdkOGYyNWMifQ.eyJhenAiOiI0MDc0MDg3MTgxOTIuYXBwcy5nb29nbGV1c2VyY29udGVudC5jb20iLCJhdWQiOiI0MDc0MDg3MTgxOTIuYXBwcy5nb29nbGV1c2VyY29udGVudC5jb20iLCJzdWIiOiIxMDA3NDA4MTcxMjQ4NjUwNDA2MTgiLCJoZCI6InVpYy5lZHUiLCJlbWFpbCI6ImtkaXhsZTJAdWljLmVkdSIsImVtYWlsX3ZlcmlmaWVkIjp0cnVlLCJhdF9oYXNoIjoiengxT2dGeURTVV9JMlRLRl9WenRBUSIsImV4cCI6MTUzMjI4MDQxNCwiaXNzIjoiaHR0cHM6Ly9hY2NvdW50cy5nb29nbGUuY29tIiwiaWF0IjoxNTMyMjc2ODE0LCJuYW1lIjoiS3lsZSBEaXhsZXIiLCJwaWN0dXJlIjoiaHR0cHM6Ly9saDUuZ29vZ2xldXNlcmNvbnRlbnQuY29tLy1CZnZfY3NOUWRHWS9BQUFBQUFBQUFBSS9BQUFBQUFBQUFBQS9BQW5uWTdyUWZfVmE5NDFpZnZYMFMxdFViYl9qU2x6OVBRL3M5Ni1jL3Bob3RvLmpwZyIsImdpdmVuX25hbWUiOiJLeWxlIiwiZmFtaWx5X25hbWUiOiJEaXhsZXIiLCJsb2NhbGUiOiJlbiJ9.H9LJ8do7VqUepbYI4t2Mr1yrvTQJYvUnoy7XGdbXTdKUhHYG7VKpoWd76MkT77oujXQhpMJ60c_BYhCo8EpxufM75gYhVWhak4L1MOWIeHKwJFfRxu9kWVsgBtsAwsUKe4J4ZswA06bLQP10i9GB1Fjo0bimRaTfFyWTDdO_UfpMVw1QvsdPFUqhTGAmqHY3dBU3sNBMZcI3LtFCUVAlCR3-YFDsOvklyhRrwNV_oqDh6HoCL4IJGViI6LMpAdSJjNElFzitlEXUV8ET2Fw1FsAxs-PPKNmYVgI1119yYKmmm_KQJoZI5vwIZtzZKdzh6pnV7SRlWtcKASh-ynr0lg"
     }
     #+END_SRC
     Now we can use the token to request user data. The token may time out, but we can use it on our end.
     We use the credential to retrieve user data:
     - email(uic email)
     #+BEGIN_SRC javascript
     // Request
     GET /oauth2/v2/userinfo HTTP/1.1
     Host: www.googleapis.com
     Content-length: 0
     Authorization: Bearer ya29.GlsABqo0h39HIGVZS3nJ_ZxU73fIfK929JGLXve2CCFJXv89HNyGY-tJZAONtfJCo1nktLYMXENSfvmZKhPehprQki1ZmluG6iHNTWwSEyHTg8NIfSmDavrH9hQd

     // Response
     HTTP/1.1 200 OK
     Content-length: 331
     X-xss-protection: 1; mode=block
     Content-location: https://www.googleapis.com/oauth2/v2/userinfo
     X-content-type-options: nosniff
     Transfer-encoding: chunked
     Expires: Mon, 01 Jan 1990 00:00:00 GMT
     Vary: Origin, X-Origin
     Server: GSE
     -content-encoding: gzip
     Pragma: no-cache
     Cache-control: no-cache, no-store, max-age=0, must-revalidate
     Date: Sun, 22 Jul 2018 16:29:04 GMT
     X-frame-options: SAMEORIGIN
     Alt-svc: quic=":443"; ma=2592000; v="44,43,39,35"
     Content-type: application/json; charset=UTF-8
     {
       "family_name": "Dixler", 
       "name": "Kyle Dixler", 
       "picture": "https://lh5.googleusercontent.com/-Bfv_csNQdGY/AAAAAAAAAAI/AAAAAAAAAAA/AAnnY7rQf_Va941ifvX0S1tUbb_jSlz9PQ/mo/photo.jpg", 
       "locale": "en", 
       "email": "kdixle2@uic.edu", 
       "given_name": "Kyle", 
       "id": "100740817124865040618", 
       "hd": "uic.edu", 
       "verified_email": true
     }
     #+END_SRC
     Then we can store the cookie into our tokens-table and return it for our user to put in localStorage and to use as their token
