docs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-01-31 Thu 08:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Kyle Dixler" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org36dedfa">1. Backend</a>
<ul>
<li><a href="#org2d7770b">1.1. Technologies</a>
<ul>
<li><a href="#orgb0b90e3">1.1.1. OAuth 2.0</a></li>
<li><a href="#org8a8534d">1.1.2. Amazon Web Services</a></li>
</ul>
</li>
<li><a href="#orga90e39c">1.2. Storage</a>
<ul>
<li><a href="#org0ab0afe">1.2.1. DynamoDB</a></li>
<li><a href="#orge2dad88">1.2.2. S3</a></li>
<li><a href="#org29ad454">1.2.3. SQS</a></li>
</ul>
</li>
<li><a href="#org9b1542b">1.3. APIs</a>
<ul>
<li><a href="#orgb14cb2e">1.3.1. Auth</a></li>
<li><a href="#orgcd4d06a">1.3.2. Upload</a></li>
<li><a href="#org5f8e71c">1.3.3. Modify Scoreboard</a></li>
<li><a href="#org264d706">1.3.4. Modify Assignment</a></li>
<li><a href="#org0bb6d59">1.3.5. Query Database</a></li>
<li><a href="#org25017c4">1.3.6. Grading Workflow</a></li>
</ul>
</li>
<li><a href="#org73c302b">1.4. Library Utilities</a>
<ul>
<li><a href="#org8bb3f2e">1.4.1. [LOCAL] getNetId(token) -&gt; string</a></li>
<li><a href="#orgda2f89e">1.4.2. [LOCAL] getTokenId(netid) -&gt; string</a></li>
<li><a href="#orgb8b4a4a">1.4.3. [LOCAL] isOwner(token, assetId, assignmentId)</a></li>
<li><a href="#orgdc436b3">1.4.4. [LOCAL] isAdmin(token)</a></li>
<li><a href="#orgec95d0b">1.4.5. [LOCAL][PRIVATE] insertDynamoDB(tablename, object) -&gt; bool</a></li>
<li><a href="#org7a3f1dc">1.4.6. [LOCAL][PRIVATE] retrieveDynamoDB(tablename, object) -&gt; bool</a></li>
</ul>
</li>
<li><a href="#org9013af8">1.5. Callable APIs</a>
<ul>
<li><a href="#orgf9ba56d">1.5.1. <code>Auth</code></a></li>
<li><a href="#org0426a41">1.5.2. <code>Create</code></a></li>
<li><a href="#orge2ff2ac">1.5.3. <code>Modify Assignment</code></a></li>
<li><a href="#org243dbe2">1.5.4. <code>Query</code></a></li>
</ul>
</li>
<li><a href="#org12c369b">1.6. Todolist</a>
<ul>
<li><a href="#org1e5f27f">1.6.1. <code>[1/1]</code> APIs</a></li>
<li><a href="#org8afb539">1.6.2. <code>[1/1]</code> API Gateway</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga55df00">2. Frontend</a>
<ul>
<li><a href="#org05a6174">2.1. Frames</a>
<ul>
<li><a href="#orgba599fa">2.1.1. Scoreboard</a></li>
<li><a href="#org84338f6">2.1.2. My Submissions</a></li>
<li><a href="#orgfbd5540">2.1.3. Admin Interface</a></li>
<li><a href="#orgb62ab41">2.1.4. User Information</a></li>
</ul>
</li>
<li><a href="#org0a97480">2.2. Storage</a>
<ul>
<li><a href="#org5f16623">2.2.1. S3</a></li>
</ul>
</li>
<li><a href="#org08f1d3e">2.3. Actions</a>
<ul>
<li><a href="#org6caee06">2.3.1. Submit Assignment</a></li>
<li><a href="#orgf1eaba2">2.3.2. Create Assignment</a></li>
<li><a href="#org4368f35">2.3.3. Select Assignment</a></li>
<li><a href="#org60f7e26">2.3.4. Log out</a></li>
</ul>
</li>
<li><a href="#org990af30">2.4. <span class="todo TODO">TODO</span> Provisioning</a>
<ul>
<li><a href="#orgb4e9502">2.4.1. S3 Bucket</a></li>
<li><a href="#org1ef0f81">2.4.2. AutoScaling group + Elastic Load Balancer</a></li>
<li><a href="#org7231a47">2.4.3. Instance Template</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org38bbbc1">3. Grading Workflow</a>
<ul>
<li><a href="#org131198b">3.1. Security</a>
<ul>
<li><a href="#org3b54a0b">3.1.1. Permissions:</a></li>
<li><a href="#orgab732ee">3.1.2. User Classes:</a></li>
<li><a href="#org84f7c0b">3.1.3. Mitigations:</a></li>
</ul>
</li>
<li><a href="#org008da22">3.2. Constraints</a></li>
<li><a href="#org2a9fe19">3.3. Grading AMI</a>
<ul>
<li><a href="#org2a9ac08">3.3.1. gcc</a></li>
<li><a href="#org446923b">3.3.2. python</a></li>
<li><a href="#orgc2857d5">3.3.3. make</a></li>
</ul>
</li>
<li><a href="#org1a000dd">3.4. Filesystem Layout</a>
<ul>
<li><a href="#orgc54d31c">3.4.1. Environment</a></li>
<li><a href="#orgcccfed0">3.4.2. DeploymentPackage.zip format</a></li>
</ul>
</li>
<li><a href="#org98562a3">3.5. [PRIVATE][ABSTRACT] gradingWorkflow(netid, assignmentId, assetId)</a>
<ul>
<li><a href="#org7c0c86b">3.5.1. Custom grading AMI</a></li>
<li><a href="#org8b455f1">3.5.2. FETCH step</a></li>
<li><a href="#org899230a">3.5.3. EXECUTE step</a></li>
<li><a href="#org1e84273">3.5.4. WRITEBACK step</a></li>
</ul>
</li>
<li><a href="#orgc36fed9">3.6. <span class="todo TODO">TODO</span> Todolist</a>
<ul>
<li><a href="#org04d6c13">3.6.1. <span class="done DONE">DONE</span> Provisioning</a></li>
<li><a href="#orgf8c2871">3.6.2. <span class="done DONE">DONE</span> Grading AMI</a></li>
<li><a href="#org179ffc7">3.6.3. <span class="done DONE">DONE</span> [EXAMPLE]DeploymentPackage.zip</a></li>
<li><a href="#org0fad855">3.6.4. <span class="done DONE">DONE</span> retrieveAssets.py</a></li>
<li><a href="#orgd31fa57">3.6.5. <span class="done DONE">DONE</span> quarantine.py</a></li>
<li><a href="#org8d81b7d">3.6.6. <span class="done DONE">DONE</span> cloudgrade.sh</a></li>
<li><a href="#org698bc57">3.6.7. <span class="done DONE">DONE</span> uploadScores.py</a></li>
<li><a href="#org42e0792">3.6.8. <span class="todo TODO">TODO</span> Monitoring CloudWatch Events</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf5fd1f5">4. <code>[1/1]</code> Knowledge Gaps</a></li>
<li><a href="#orge78ad18">5. Reach Goals</a>
<ul>
<li><a href="#orgcd06a0b">5.1. Hidden Assignments for DEV/Prototyping</a></li>
<li><a href="#org8ac9d9e">5.2. Deleting Assignments</a></li>
<li><a href="#org1b1be3b">5.3. Using user data to populate scripts into Grading Workflow Instance Template</a>
<ul>
<li><a href="#org78dbd8a">5.3.1. Makes it more modular and faster to update scripts</a></li>
</ul>
</li>
<li><a href="#org464c410">5.4. <code>[0/3]</code> Reach Goals</a>
<ul>
<li><a href="#org260c700">5.4.1. <span class="todo TODO">TODO</span> [PROTECTED] changeScoring(token, assignmentId, scoreBreakdown)</a></li>
<li><a href="#org12c2991">5.4.2. <span class="todo TODO">TODO</span> [PROTECTED] changeDeploymentPackage(token, assignmentId, deploymentPackage)</a></li>
<li><a href="#org5df9267">5.4.3. <span class="todo TODO">TODO</span> [UNNECESSARY][PROTECTED] continueSession(token) -&gt; bool</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org36dedfa" class="outline-2">
<h2 id="org36dedfa"><span class="section-number-2">1</span> Backend</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2d7770b" class="outline-3">
<h3 id="org2d7770b"><span class="section-number-3">1.1</span> Technologies</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgb0b90e3" class="outline-4">
<h4 id="orgb0b90e3"><span class="section-number-4">1.1.1</span> OAuth 2.0</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="org555f486"></a>Playground<br />
<div class="outline-text-5" id="text-1-1-1-1">
<p>
targets:
<a href="https://www.googleapis.com/auth/userinfo.email">https://www.googleapis.com/auth/userinfo.email</a>
<a href="https://www.googleapis.com/auth/userinfo.profile">https://www.googleapis.com/auth/userinfo.profile</a>
</p>

<p>
<a href="https://accounts.google.com/o/oauth2/v2/auth?redirect_uri=https://developers.google.com/oauthplayground&amp;prompt=consent&amp;response_type=code&amp;client_id=407408718192.apps.googleusercontent.com&amp;scope=https://www.googleapis.com/auth/userinfo.email+https://www.googleapis.com/auth/userinfo.profile&amp;access_type=offline">https://accounts.google.com/o/oauth2/v2/auth?redirect_uri=https://developers.google.com/oauthplayground&amp;prompt=consent&amp;response_type=code&amp;client_id=407408718192.apps.googleusercontent.com&amp;scope=https://www.googleapis.com/auth/userinfo.email+https://www.googleapis.com/auth/userinfo.profile&amp;access_type=offline</a>
send the returned token to the application to request a token
request:
</p>
<div class="org-src-container">
<pre class="src src-javascript">// Request
POST /oauth2/v4/token HTTP/1.1
Host: www.googleapis.com
Content-length: 277
content-type: application/x-www-form-urlencoded
user-agent: google-oauth-playground
code=4%2FAAC8yZdfe98kiiX6R-lojj5Dqe4HHtGkDPMlaFobNBn1ai4aHpmRhpyZvD49xxsyHJaD5of_1zf50I7KyMZeXyk&amp;redirect_uri=https%3A%2F%2Fdevelopers.google.com%2Foauthplayground&amp;client_id=407408718192.apps.googleusercontent.com&amp;client_secret=************&amp;scope=&amp;grant_type=authorization_code

// Response
HTTP/1.1 200 OK
Content-length: 1389
X-xss-protection: 1; mode=block
X-content-type-options: nosniff
Transfer-encoding: chunked
Expires: Mon, 01 Jan 1990 00:00:00 GMT
Vary: Origin, X-Origin
Server: GSE
-content-encoding: gzip
Pragma: no-cache
Cache-control: no-cache, no-store, max-age=0, must-revalidate
Date: Sun, 22 Jul 2018 16:26:54 GMT
X-frame-options: SAMEORIGIN
Alt-svc: quic=":443"; ma=2592000; v="44,43,39,35"
Content-type: application/json; charset=UTF-8
{
  // This is unique to the application
  "access_token": "ya29.GlsABqo0h39HIGVZS3nJ_ZxU73fIfK929JGLXve2CCFJXv89HNyGY-tJZAONtfJCo1nktLYMXENSfvmZKhPehprQki1ZmluG6iHNTWwSEyHTg8NIfSmDavrH9hQd", 
  "token_type": "Bearer", 
  "expires_in": 3600, 
  "refresh_token": "1/w2Ix95nfsB8x7dc_og4PhtvqxKKs10t2LW4-xvoZmxU", 
  // This is unique to the user
  "id_token": "eyJhbGciOiJSUzI1NiIsImtpZCI6ImM2YWY3Y2FhMDg5NWZkMDFlNzc4ZGNlYWE3YTc5ODgzNDdkOGYyNWMifQ.eyJhenAiOiI0MDc0MDg3MTgxOTIuYXBwcy5nb29nbGV1c2VyY29udGVudC5jb20iLCJhdWQiOiI0MDc0MDg3MTgxOTIuYXBwcy5nb29nbGV1c2VyY29udGVudC5jb20iLCJzdWIiOiIxMDA3NDA4MTcxMjQ4NjUwNDA2MTgiLCJoZCI6InVpYy5lZHUiLCJlbWFpbCI6ImtkaXhsZTJAdWljLmVkdSIsImVtYWlsX3ZlcmlmaWVkIjp0cnVlLCJhdF9oYXNoIjoiengxT2dGeURTVV9JMlRLRl9WenRBUSIsImV4cCI6MTUzMjI4MDQxNCwiaXNzIjoiaHR0cHM6Ly9hY2NvdW50cy5nb29nbGUuY29tIiwiaWF0IjoxNTMyMjc2ODE0LCJuYW1lIjoiS3lsZSBEaXhsZXIiLCJwaWN0dXJlIjoiaHR0cHM6Ly9saDUuZ29vZ2xldXNlcmNvbnRlbnQuY29tLy1CZnZfY3NOUWRHWS9BQUFBQUFBQUFBSS9BQUFBQUFBQUFBQS9BQW5uWTdyUWZfVmE5NDFpZnZYMFMxdFViYl9qU2x6OVBRL3M5Ni1jL3Bob3RvLmpwZyIsImdpdmVuX25hbWUiOiJLeWxlIiwiZmFtaWx5X25hbWUiOiJEaXhsZXIiLCJsb2NhbGUiOiJlbiJ9.H9LJ8do7VqUepbYI4t2Mr1yrvTQJYvUnoy7XGdbXTdKUhHYG7VKpoWd76MkT77oujXQhpMJ60c_BYhCo8EpxufM75gYhVWhak4L1MOWIeHKwJFfRxu9kWVsgBtsAwsUKe4J4ZswA06bLQP10i9GB1Fjo0bimRaTfFyWTDdO_UfpMVw1QvsdPFUqhTGAmqHY3dBU3sNBMZcI3LtFCUVAlCR3-YFDsOvklyhRrwNV_oqDh6HoCL4IJGViI6LMpAdSJjNElFzitlEXUV8ET2Fw1FsAxs-PPKNmYVgI1119yYKmmm_KQJoZI5vwIZtzZKdzh6pnV7SRlWtcKASh-ynr0lg"
}
</pre>
</div>
<p>
Now we can use the token to request user data. The token may time out, but we can use it on our end.
We use the credential to retrieve user data:
</p>
<ul class="org-ul">
<li>email(uic email)</li>
</ul>
<div class="org-src-container">
<pre class="src src-javascript">// Request
GET /oauth2/v2/userinfo HTTP/1.1
Host: www.googleapis.com
Content-length: 0
Authorization: Bearer ya29.GlsABqo0h39HIGVZS3nJ_ZxU73fIfK929JGLXve2CCFJXv89HNyGY-tJZAONtfJCo1nktLYMXENSfvmZKhPehprQki1ZmluG6iHNTWwSEyHTg8NIfSmDavrH9hQd

// Response
HTTP/1.1 200 OK
Content-length: 331
X-xss-protection: 1; mode=block
Content-location: https://www.googleapis.com/oauth2/v2/userinfo
X-content-type-options: nosniff
Transfer-encoding: chunked
Expires: Mon, 01 Jan 1990 00:00:00 GMT
Vary: Origin, X-Origin
Server: GSE
-content-encoding: gzip
Pragma: no-cache
Cache-control: no-cache, no-store, max-age=0, must-revalidate
Date: Sun, 22 Jul 2018 16:29:04 GMT
X-frame-options: SAMEORIGIN
Alt-svc: quic=":443"; ma=2592000; v="44,43,39,35"
Content-type: application/json; charset=UTF-8
{
  "family_name": "Dixler", 
  "name": "Kyle Dixler", 
  "picture": "https://lh5.googleusercontent.com/-Bfv_csNQdGY/AAAAAAAAAAI/AAAAAAAAAAA/AAnnY7rQf_Va941ifvX0S1tUbb_jSlz9PQ/mo/photo.jpg", 
  "locale": "en", 
  "email": "kdixle2@uic.edu", 
  "given_name": "Kyle", 
  "id": "100740817124865040618", 
  "hd": "uic.edu", 
  "verified_email": true
}
</pre>
</div>
<p>
Then we can store the cookie into our tokens-table and return it for our user to put in localStorage and to use as their token
</p>
</div>
</li>
</ol>
</div>
