docs.org
*** Amazon Web Services
**** DynamoDB
**** S3
**** Lambda
**** API Gateway
**** EC2
** Storage
*** DynamoDB
**** tokens-table
     Stores the session credentials of our users
     put a lifecycle policy for these tokens
     #+BEGIN_SRC javascript
       //"token": "eyJhbGciOiJSUzI1NiIsImtpZCI6ImM2YWY3Y2FhMDg5NWZkMDFlNzc4ZGNlYWE3YTc5ODgzNDdkOGYyNWMifQ.eyJhenAiOiI0MDc0MDg3MTgxOTIuYXBwcy5nb29nbGV1c2VyY29udGVudC5jb20iLCJhdWQiOiI0MDc0MDg3MTgxOTIuYXBwcy5nb29nbGV1c2VyY29udGVudC5jb20iLCJzdWIiOiIxMDA3NDA4MTcxMjQ4NjUwNDA2MTgiLCJoZCI6InVpYy5lZHUiLCJlbWFpbCI6ImtkaXhsZTJAdWljLmVkdSIsImVtYWlsX3ZlcmlmaWVkIjp0cnVlLCJhdF9oYXNoIjoiengxT2dGeURTVV9JMlRLRl9WenRBUSIsImV4cCI6MTUzMjI4MDQxNCwiaXNzIjoiaHR0cHM6Ly9hY2NvdW50cy5nb29nbGUuY29tIiwiaWF0IjoxNTMyMjc2ODE0LCJuYW1lIjoiS3lsZSBEaXhsZXIiLCJwaWN0dXJlIjoiaHR0cHM6Ly9saDUuZ29vZ2xldXNlcmNvbnRlbnQuY29tLy1CZnZfY3NOUWRHWS9BQUFBQUFBQUFBSS9BQUFBQUFBQUFBQS9BQW5uWTdyUWZfVmE5NDFpZnZYMFMxdFViYl9qU2x6OVBRL3M5Ni1jL3Bob3RvLmpwZyIsImdpdmVuX25hbWUiOiJLeWxlIiwiZmFtaWx5X25hbWUiOiJEaXhsZXIiLCJsb2NhbGUiOiJlbiJ9.H9LJ8do7VqUepbYI4t2Mr1yrvTQJYvUnoy7XGdbXTdKUhHYG7VKpoWd76MkT77oujXQhpMJ60c_BYhCo8EpxufM75gYhVWhak4L1MOWIeHKwJFfRxu9kWVsgBtsAwsUKe4J4ZswA06bLQP10i9GB1Fjo0bimRaTfFyWTDdO_UfpMVw1QvsdPFUqhTGAmqHY3dBU3sNBMZcI3LtFCUVAlCR3-YFDsOvklyhRrwNV_oqDh6HoCL4IJGViI6LMpAdSJjNElFzitlEXUV8ET2Fw1FsAxs-PPKNmYVgI1119yYKmmm_KQJoZI5vwIZtzZKdzh6pnV7SRlWtcKASh-ynr0lg",
     {
       "token": "251",
       "netid": "kdixle2"
     }
     #+END_SRC
**** users-table
     Stores user credentials to allow for secrets, token is the tokenized user name generated 
     from the first time the user entered salted with their netid, we don't need to query the 
     board to reverse the tokenization.
     #+BEGIN_SRC javascript
     {
       "netid": "kdixle2",
       "admin": true,
       "uin": "666666666",
       "tokenid": "c1f8b18730737be44ea82b2a9ffd887729bd9ded1960e4b38bf49492fb0d1fa3"
     }
     #+END_SRC
**** submissions-table
     Store all of the submissions across every assignment
     #+BEGIN_SRC javascript
      // the asset id is generated using the submission time and the shasum of the submission
     {
       "assetId": "c1f8b18730737be44ea82b2a9ffd887729bd9ded1960e4b38bf49492fb0d1fa3",
       "netid": "kdixle2",
       "assignmentId": 0,
       "submissionDate": "2018-07-02 11:59",
       "state": "SUBMITTED"|"SCORED",
       "score": 100,
       "scoreBreakdown": {
         "some_field": 100,
         "other_field": 100,
         "my_field": 100,
         "field": 100,
         "feld": 100
       }
     }
     #+END_SRC
**** scoreboard-table
     we will be using the tokenid as the HASH key and the assignmentId as the RANGE key
     Store the highest scores for each student
     tokenid should be unique to each assignmentId
     #+BEGIN_SRC javascript
     {
       // the asset id is generated using the submission time and the shasum of the submission
       "assetId": "c1f8b18730737be44ea82b2a9ffd887729bd9ded1960e4b38bf49492fb0d1fa3",
       "assignmentId": 0,
       "tokenid": "c1f8b18730737be44ea82b2a9ffd887729bd9ded1960e4b38bf49492fb0d1fa3",
       "submissionDate": "2018-07-02 11:59",
       "state": "SUBMITTED"|"SCORED",
       "score": 100,
       "scoreBreakdown": {
         "some_field": 100,
         "other_field": 100,
         "my_field": 100,
         "field": 100,
         "feld": 100
       }
     }
     #+END_SRC
**** assignments-table
     Store the data for each assignment
     using [-1] as the metadata index
     #+BEGIN_SRC javascript
     {
       "assignmentId": 0,
       "assignmentName": "Linked Lists",
       "deadline": "2018-07-02 11:59",
       "score": 100,
       "scoreBreakdown": {
         // these are user defined and are up to the user to keep coherent
         "some_field": 100,
         "other_field": 100,
         "my_field": 100,
         "field": 100,
         "feld": 100
       }
     }
     #+END_SRC
**** configuration-table
     Store resource names and mappings to make this solution more generic
     #+BEGIN_SRC javascript
     {
       "CRN": 44322,
       "metadata": {
         "instructor": "John Lillis",
         "course_number": "251",
         "course_name": "Data Structures"
       },
       "s3": {
         "documents-bucket": "$bucketname"
       },
       "dynamodb": {
         "users-table": "$tablename",
         "assignments-table": "$tablename",
         "submissions-table": "$tablename"
       }
       "sqs": {
         "grading-queue": "$queuename"
       }
    }
    
     #+END_SRC
*** S3
**** documents-bucket
     Stores everyone's submissions and the testing deploy packages.
     Namespace appears like this

       s3://documents-bucket.name/assignment.assignmentId/...

***** Deployment Packages
     Deploy Packages are stored at:
     #+BEGIN_SRC javascript
     {$configuration-table[$CRN]["s3"]["documents-bucket"]}/{$assignments-table[$assignmentId]}/"deploymentPackage.zip"
     // uic-documents-bucket-44322-fa2018/0/deploymentPackage.zip
     #+END_SRC

***** Assets
     Assets are stored at:
     #+BEGIN_SRC javascript
     {$configuration-table[$CRN]["s3"]["documents-bucket"]}/{$assignments-table[$assignmentId].assignmentId}/{sha256hash(asset+$submissionTime+$random)}
     // uic-documents-bucket-44322-fa2018/0/c1f8b18730737be44ea82b2a9ffd887729bd9ded1960e4b38bf49492fb0d1fa3
     // the lookup in the assignments table is done as a check to see if the assignment is valid otherwise an exception will be thrown
     #+END_SRC

*** SQS
**** [FIFO] grading-queue
     stores the list of assets to be graded.
     using content based deduplication:
     - Our assetIds should be unique thus our messages will be unique so we 
       should use extra protections
***** data format:
    #+BEGIN_SRC javascript
    {
      "assetId": "{assetId}",
      "assetBucket": "{documents-bucket-name}",
      "assignmentId": "{assignmentId}"
    }
    #+END_SRC

** APIs
*** Auth
**** [PUBLIC] login(authorizationCode) -> bearerToken
     Responsibility to get a new login token and associate it with the current user.
     If that user doesn't exist, make them exist and populate their users-table entry using the hash of the current time
***** Assets
****** DynamoDB:
******* Read:
       - users-table
******* Write:
       - tokens-table
       - users-table
**** [PROTECTED] continueSession(token) -> bool
     Responsibility to verify that the token is legitimate
***** Assets
****** DynamoDB:
******* Read:
       - tokens-table
******* Write:
**** [PROTECTED] logout(token) -> null
***** Assets
****** DynamoDB:
******* Read:
******* Write:
       - tokens-table
*** Upload
**** [PROTECTED] submitAssignment(token, assignmentId, asset)
***** Assets
****** DynamoDB:
