docs.html
<div id="outline-container-org8a8534d" class="outline-4">
<h4 id="org8a8534d"><span class="section-number-4">1.1.2</span> Amazon Web Services</h4>
<div class="outline-text-4" id="text-1-1-2">
</div>
<ol class="org-ol">
<li><a id="org626f0b5"></a>DynamoDB<br /></li>
<li><a id="org2638e4f"></a>S3<br /></li>
<li><a id="orgcdf65f1"></a>Lambda<br /></li>
<li><a id="org2670af8"></a>API Gateway<br /></li>
<li><a id="org4eb1840"></a>EC2<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orga90e39c" class="outline-3">
<h3 id="orga90e39c"><span class="section-number-3">1.2</span> Storage</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org0ab0afe" class="outline-4">
<h4 id="org0ab0afe"><span class="section-number-4">1.2.1</span> DynamoDB</h4>
<div class="outline-text-4" id="text-1-2-1">
</div>
<ol class="org-ol">
<li><a id="org254c27e"></a>tokens-table<br />
<div class="outline-text-5" id="text-1-2-1-1">
<p>
Stores the session credentials of our users
put a lifecycle policy for these tokens
</p>
<div class="org-src-container">
<pre class="src src-javascript">  //"token": "eyJhbGciOiJSUzI1NiIsImtpZCI6ImM2YWY3Y2FhMDg5NWZkMDFlNzc4ZGNlYWE3YTc5ODgzNDdkOGYyNWMifQ.eyJhenAiOiI0MDc0MDg3MTgxOTIuYXBwcy5nb29nbGV1c2VyY29udGVudC5jb20iLCJhdWQiOiI0MDc0MDg3MTgxOTIuYXBwcy5nb29nbGV1c2VyY29udGVudC5jb20iLCJzdWIiOiIxMDA3NDA4MTcxMjQ4NjUwNDA2MTgiLCJoZCI6InVpYy5lZHUiLCJlbWFpbCI6ImtkaXhsZTJAdWljLmVkdSIsImVtYWlsX3ZlcmlmaWVkIjp0cnVlLCJhdF9oYXNoIjoiengxT2dGeURTVV9JMlRLRl9WenRBUSIsImV4cCI6MTUzMjI4MDQxNCwiaXNzIjoiaHR0cHM6Ly9hY2NvdW50cy5nb29nbGUuY29tIiwiaWF0IjoxNTMyMjc2ODE0LCJuYW1lIjoiS3lsZSBEaXhsZXIiLCJwaWN0dXJlIjoiaHR0cHM6Ly9saDUuZ29vZ2xldXNlcmNvbnRlbnQuY29tLy1CZnZfY3NOUWRHWS9BQUFBQUFBQUFBSS9BQUFBQUFBQUFBQS9BQW5uWTdyUWZfVmE5NDFpZnZYMFMxdFViYl9qU2x6OVBRL3M5Ni1jL3Bob3RvLmpwZyIsImdpdmVuX25hbWUiOiJLeWxlIiwiZmFtaWx5X25hbWUiOiJEaXhsZXIiLCJsb2NhbGUiOiJlbiJ9.H9LJ8do7VqUepbYI4t2Mr1yrvTQJYvUnoy7XGdbXTdKUhHYG7VKpoWd76MkT77oujXQhpMJ60c_BYhCo8EpxufM75gYhVWhak4L1MOWIeHKwJFfRxu9kWVsgBtsAwsUKe4J4ZswA06bLQP10i9GB1Fjo0bimRaTfFyWTDdO_UfpMVw1QvsdPFUqhTGAmqHY3dBU3sNBMZcI3LtFCUVAlCR3-YFDsOvklyhRrwNV_oqDh6HoCL4IJGViI6LMpAdSJjNElFzitlEXUV8ET2Fw1FsAxs-PPKNmYVgI1119yYKmmm_KQJoZI5vwIZtzZKdzh6pnV7SRlWtcKASh-ynr0lg",
{
  "token": "251",
  "netid": "kdixle2"
}
</pre>
</div>
</div>
</li>
<li><a id="org84fa658"></a>users-table<br />
<div class="outline-text-5" id="text-1-2-1-2">
<p>
Stores user credentials to allow for secrets, token is the tokenized user name generated 
from the first time the user entered salted with their netid, we don't need to query the 
board to reverse the tokenization.
</p>
<div class="org-src-container">
<pre class="src src-javascript">{
  "netid": "kdixle2",
  "admin": true,
  "uin": "666666666",
  "tokenid": "c1f8b18730737be44ea82b2a9ffd887729bd9ded1960e4b38bf49492fb0d1fa3"
}
</pre>
</div>
</div>
</li>
<li><a id="org7e651d5"></a>submissions-table<br />
<div class="outline-text-5" id="text-1-2-1-3">
<p>
Store all of the submissions across every assignment
</p>
<div class="org-src-container">
<pre class="src src-javascript"> // the asset id is generated using the submission time and the shasum of the submission
{
  "assetId": "c1f8b18730737be44ea82b2a9ffd887729bd9ded1960e4b38bf49492fb0d1fa3",
  "netid": "kdixle2",
  "assignmentId": 0,
  "submissionDate": "2018-07-02 11:59",
  "state": "SUBMITTED"|"SCORED",
  "score": 100,
  "scoreBreakdown": {
    "some_field": 100,
    "other_field": 100,
    "my_field": 100,
    "field": 100,
    "feld": 100
  }
}
</pre>
</div>
</div>
</li>
<li><a id="org347af1f"></a>scoreboard-table<br />
<div class="outline-text-5" id="text-1-2-1-4">
<p>
we will be using the tokenid as the HASH key and the assignmentId as the RANGE key
Store the highest scores for each student
tokenid should be unique to each assignmentId
</p>
<div class="org-src-container">
<pre class="src src-javascript">{
  // the asset id is generated using the submission time and the shasum of the submission
  "assetId": "c1f8b18730737be44ea82b2a9ffd887729bd9ded1960e4b38bf49492fb0d1fa3",
  "assignmentId": 0,
  "tokenid": "c1f8b18730737be44ea82b2a9ffd887729bd9ded1960e4b38bf49492fb0d1fa3",
  "submissionDate": "2018-07-02 11:59",
  "state": "SUBMITTED"|"SCORED",
  "score": 100,
  "scoreBreakdown": {
    "some_field": 100,
    "other_field": 100,
    "my_field": 100,
    "field": 100,
    "feld": 100
  }
}
</pre>
</div>
</div>
</li>
<li><a id="orga62e23d"></a>assignments-table<br />
<div class="outline-text-5" id="text-1-2-1-5">
<p>
Store the data for each assignment
using [-1] as the metadata index
</p>
<div class="org-src-container">
<pre class="src src-javascript">{
  "assignmentId": 0,
  "assignmentName": "Linked Lists",
  "deadline": "2018-07-02 11:59",
  "score": 100,
  "scoreBreakdown": {
    // these are user defined and are up to the user to keep coherent
    "some_field": 100,
    "other_field": 100,
    "my_field": 100,
    "field": 100,
    "feld": 100
  }
}
</pre>
</div>
</div>
</li>
<li><a id="org87cd38b"></a>configuration-table<br />
<div class="outline-text-5" id="text-1-2-1-6">
<p>
Store resource names and mappings to make this solution more generic
</p>
<div class="org-src-container">
<pre class="src src-javascript"> {
   "CRN": 44322,
   "metadata": {
     "instructor": "John Lillis",
     "course_number": "251",
     "course_name": "Data Structures"
   },
   "s3": {
     "documents-bucket": "$bucketname"
   },
   "dynamodb": {
     "users-table": "$tablename",
     "assignments-table": "$tablename",
     "submissions-table": "$tablename"
   }
   "sqs": {
     "grading-queue": "$queuename"
   }
}

</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orge2dad88" class="outline-4">
<h4 id="orge2dad88"><span class="section-number-4">1.2.2</span> S3</h4>
<div class="outline-text-4" id="text-1-2-2">
</div>
<ol class="org-ol">
<li><a id="orgd8a5fc8"></a>documents-bucket<br />
<div class="outline-text-5" id="text-1-2-2-1">
<p>
Stores everyone's submissions and the testing deploy packages.
Namespace appears like this
</p>

<p>
s3://documents-bucket.name/assignment.assignmentId/&#x2026;
</p>
</div>

<ol class="org-ol">
<li><a id="org43c7fae"></a>Deployment Packages<br />
<div class="outline-text-6" id="text-1-2-2-1-1">
<p>
Deploy Packages are stored at:
</p>
<div class="org-src-container">
<pre class="src src-javascript">{$configuration-table[$CRN]["s3"]["documents-bucket"]}/{$assignments-table[$assignmentId]}/"deploymentPackage.zip"
// uic-documents-bucket-44322-fa2018/0/deploymentPackage.zip
</pre>
</div>
</div>
</li>

<li><a id="org7d80967"></a>Assets<br />
<div class="outline-text-6" id="text-1-2-2-1-2">
<p>
Assets are stored at:
</p>
<div class="org-src-container">
<pre class="src src-javascript">{$configuration-table[$CRN]["s3"]["documents-bucket"]}/{$assignments-table[$assignmentId].assignmentId}/{sha256hash(asset+$submissionTime+$random)}
// uic-documents-bucket-44322-fa2018/0/c1f8b18730737be44ea82b2a9ffd887729bd9ded1960e4b38bf49492fb0d1fa3
// the lookup in the assignments table is done as a check to see if the assignment is valid otherwise an exception will be thrown
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>

<div id="outline-container-org29ad454" class="outline-4">
<h4 id="org29ad454"><span class="section-number-4">1.2.3</span> SQS</h4>
<div class="outline-text-4" id="text-1-2-3">
</div>
<ol class="org-ol">
<li><a id="orgffcf1d8"></a>[FIFO] grading-queue<br />
<div class="outline-text-5" id="text-1-2-3-1">
<p>
stores the list of assets to be graded.
using content based deduplication:
</p>
<ul class="org-ul">
<li>Our assetIds should be unique thus our messages will be unique so we 
should use extra protections</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orgdd9b272"></a>data format:<br />
<div class="outline-text-6" id="text-1-2-3-1-1">
<div class="org-src-container">
<pre class="src src-javascript">{
  "assetId": "{assetId}",
  "assetBucket": "{documents-bucket-name}",
  "assignmentId": "{assignmentId}"
}
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-org9b1542b" class="outline-3">
<h3 id="org9b1542b"><span class="section-number-3">1.3</span> APIs</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgb14cb2e" class="outline-4">
<h4 id="orgb14cb2e"><span class="section-number-4">1.3.1</span> Auth</h4>
<div class="outline-text-4" id="text-1-3-1">
</div>
<ol class="org-ol">
<li><a id="org06dd9a3"></a>[PUBLIC] login(authorizationCode) -&gt; bearerToken<br />
<div class="outline-text-5" id="text-1-3-1-1">
<p>
Responsibility to get a new login token and associate it with the current user.
If that user doesn't exist, make them exist and populate their users-table entry using the hash of the current time
</p>
</div>
<ol class="org-ol">
