docs.org
******* Read:
       - tokens-table (validation)
       - assignments-table (validation)
       - users-table (retrieve netid)
******* Write:
       - submissions-table
       provisions the submission-table entry to be modified later
     #+BEGIN_SRC javascript
       // the asset id is generated using the submission time and the shasum of the submission
     {
       "assetId": "c1f8b18730737be44ea82b2a9ffd887729bd9ded1960e4b38bf49492fb0d1fa3",
       "assignmentId": 0,
       "netid": "kdixle2",
       "state": "SUBMITTED"
       "score": 0,
       "scoreBreakdown": {}
     }
     #+END_SRC
       INDIRECTLY -> scoreboard-table
         Workflow may modify this table if this is the new highest score
        #+BEGIN_SRC python
        if score > currentScore:
          updateScoreboard(netid, assetId, assignmentId)
        #+END_SRC
****** S3:
******* Read:
******* Write:
       - documents-bucket/$assignmentId/{sha256sum(asset+submissionTime+random)}
****** SQS:
******* Read:
******* Write:
       - grading-queue
**** [PROTECTED][ADMIN] createAssignment(token, assignmentName, deploymentPackage, deadline, scoreBreakdown)
     Need to make sure to validate that the user is an admin
***** Assets
****** DynamoDB:
******* Read:
       - tokens-table(validation isUser)
       - users-table(validation isAdmin)
******* Write:
       - assignments-table
     #+BEGIN_SRC javascript
     {
       "assignmentId": {GENERATED},
       "assignmentName": $assignmentName,
       "deadline": $deadline,
       "score": $scoreBreakdown
     }
     // call params, base64 encoded
     {
    	"token": "251",
       "assignmentName": "Linked Lists",
       "deadline": "2018-12-02 11:59",
       "deploymentPackage": "I2luY2x1ZGUgPHN0ZGlvLmg+CiNpbmNsdWRlIDxzdGRsaWIuaD4KCmludCBtYWluKCl7CiAgIHByaW50ZigiSGVsbG8gV29ybGQhXG4iKTsKICAgcmV0dXJuIDA7Cn0K",
       "scoreBreakdown": {
       	"score": 100,
        "scoreBreakdown": {
          "some_field": 100,
          "other_field": 100,
          "my_field": 100,
          "field": 100,
          "feld": 100
        	}
        }
     }
     #+END_SRC
****** S3:
******* Read:
******* Write:
       - documents-bucket/{assignments-table[assignmentId]}/deploymentPackage.zip
**** [PRIVATE] enterScore(assetId, assignmentId, score, scoreBreakdown)
     Writes a score in for the submission.
***** Assets
****** DynamoDB:
******* Read:
******* Write:
       - submissions-table
    
*** Modify Scoreboard
**** [PRIVATE] updateScoreboard(netid, assetId, assignmentId)
***** Trigger: submissions-table dynamodb stream[MODIFY]
      When the submissions-table is modified,
       if the $SUBMISSION.state is 'SCORED', then
         if the $SUBMISSION.score is larger than the current scoreboard submission for getTokenId($SUBMISSION.netid)
           replace current scoreboard entry with tokenizedSubmission($ENTRY)

      its the highest of 
***** Assets
****** DynamoDB:
******* Read:
       - submissions-table
******* Write:
       - scoreboard-table
    
*** Modify Assignment
**** [PROTECTED][ADMIN] changeDeadline(token, assignmentId, deadline)
     What if it's being extended after it's due?
***** Assets
****** DynamoDB:
******* Read:
       - tokens-table
       - users-table
******* Write:
       - assignments-table
     #+BEGIN_SRC javascript
     {
       "assignmentId": assignmentId,
       "deadline": $deadline
     }
     #+END_SRC
**** [FUTURE] =[PROTECTED][ADMIN] changeScoring(token, assignmentId, scoreBreakdown)=
     ot my prNoblem if the rubric is broken
     his may Trequire a change of the deployment package
*****Assets   
***** DynamoD*B:
****** Read: *
      - token s-table
      - users -table
****** Write:*
      - assig nments-table
     +BEGIN_S#RC javascript
             {
      "assign mentId": assignmentId,
      "deadli ne": $deadline
             }
     +END_SRC#

**** [FUTURE] =[PROTECTED][ADMIN] changeDeploymentPackage(token, assignmentId, deploymentPackage)=
     Not my problem if the deployment package is broken. This is a future reach goal
     This may require a change of the scoring
***** Assets
****** DynamoDB:
******* Read:
        - tokens-table(validate isUser)
        - users-table(validate isAdmin)
******* Write:
****** S3:
******* Read:
******* Write:
       - documents-bucket/{assignments-table[assignmentId]}/deploymentPackage.zip

*** Query Database
**** [PROTECTED] getSubmissions(token, assignmentId) -> [submission, ...]
***** Assets
****** DynamoDB:
******* Read:
       - tokens-table
       - assignments-table(validate)
       - submissions-table
******* Write:
**** [PROTECTED] getScoreboard(token, assignmentId) -> [tokenizedSubmission, ...]
***** Assets
****** DynamoDB:
******* Read:
       - tokens-table
       - assignments-table
       - scoreboard-table
******* Write:
**** [PROTECTED] getAssignments(token) -> [assignment, ...]
***** Assets
****** DynamoDB:
******* Read:
       - tokens-table
       - assignments-table
******* Write:
