docs.html
<li><a id="org185322d"></a>Assets<br />
<ol class="org-ol">
<li><a id="org9b69749"></a>DynamoDB:<br />
<ol class="org-ol">
<li><a id="orgea1e705"></a>Read:<br />
<div class="outline-text-8" id="text-1-3-1-1-1-1-1">
<ul class="org-ul">
<li>users-table</li>
</ul>
</div>
</li>
<li><a id="orgd9ac1b1"></a>Write:<br />
<div class="outline-text-8" id="text-1-3-1-1-1-1-2">
<ul class="org-ul">
<li>tokens-table</li>
<li>users-table</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
<li><a id="orgd32bea9"></a>[PROTECTED] continueSession(token) -&gt; bool<br />
<div class="outline-text-5" id="text-1-3-1-2">
<p>
Responsibility to verify that the token is legitimate
</p>
</div>
<ol class="org-ol">
<li><a id="org7ae46ef"></a>Assets<br />
<ol class="org-ol">
<li><a id="org311c178"></a>DynamoDB:<br />
<ol class="org-ol">
<li><a id="org335e5d5"></a>Read:<br />
<div class="outline-text-8" id="text-1-3-1-2-1-1-1">
<ul class="org-ul">
<li>tokens-table</li>
</ul>
</div>
</li>
<li><a id="orgd14b169"></a>Write:<br /></li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
<li><a id="orga525d99"></a>[PROTECTED] logout(token) -&gt; null<br />
<ol class="org-ol">
<li><a id="org06f571e"></a>Assets<br />
<ol class="org-ol">
<li><a id="org9f4c7d1"></a>DynamoDB:<br />
<ol class="org-ol">
<li><a id="orgd6f52fa"></a>Read:<br /></li>
<li><a id="org2f758ce"></a>Write:<br />
<div class="outline-text-8" id="text-1-3-1-3-1-1-2">
<ul class="org-ul">
<li>tokens-table</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgcd4d06a" class="outline-4">
<h4 id="orgcd4d06a"><span class="section-number-4">1.3.2</span> Upload</h4>
<div class="outline-text-4" id="text-1-3-2">
</div>
<ol class="org-ol">
<li><a id="orgd9c810e"></a>[PROTECTED] submitAssignment(token, assignmentId, asset)<br />
<ol class="org-ol">
<li><a id="org84ee639"></a>Assets<br />
<ol class="org-ol">
<li><a id="org7dc1a94"></a>DynamoDB:<br />
<ol class="org-ol">
<li><a id="orgdadcdd0"></a>Read:<br />
<div class="outline-text-8" id="text-1-3-2-1-1-1-1">
<ul class="org-ul">
<li>tokens-table (validation)</li>
<li>assignments-table (validation)</li>
<li>users-table (retrieve netid)</li>
</ul>
</div>
</li>
<li><a id="orga6f9846"></a>Write:<br />
<div class="outline-text-8" id="text-1-3-2-1-1-1-2">
<ul class="org-ul">
<li>submissions-table</li>
</ul>
<p>
provisions the submission-table entry to be modified later
</p>
<div class="org-src-container">
<pre class="src src-javascript">  // the asset id is generated using the submission time and the shasum of the submission
{
  "assetId": "c1f8b18730737be44ea82b2a9ffd887729bd9ded1960e4b38bf49492fb0d1fa3",
  "assignmentId": 0,
  "netid": "kdixle2",
  "state": "SUBMITTED"
  "score": 0,
  "scoreBreakdown": {}
}
</pre>
</div>
<p>
INDIRECTLY -&gt; scoreboard-table
  Workflow may modify this table if this is the new highest score
</p>
<div class="org-src-container">
<pre class="src src-python">if score &gt; currentScore:
  updateScoreboard(netid, assetId, assignmentId)
</pre>
</div>
</div>
</li>
</ol>
</li>
<li><a id="orgca6b8c6"></a>S3:<br />
<ol class="org-ol">
<li><a id="orgb168349"></a>Read:<br /></li>
<li><a id="org3f74e1d"></a>Write:<br />
<div class="outline-text-8" id="text-1-3-2-1-1-2-2">
<ul class="org-ul">
<li>documents-bucket/$assignmentId/{sha256sum(asset+submissionTime+random)}</li>
</ul>
</div>
</li>
</ol>
</li>
<li><a id="orgd576175"></a>SQS:<br />
<ol class="org-ol">
<li><a id="org119c01c"></a>Read:<br /></li>
<li><a id="org1ca4ea4"></a>Write:<br />
<div class="outline-text-8" id="text-1-3-2-1-1-3-2">
<ul class="org-ul">
<li>grading-queue</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
<li><a id="org6a0e899"></a>[PROTECTED][ADMIN] createAssignment(token, assignmentName, deploymentPackage, deadline, scoreBreakdown)<br />
<div class="outline-text-5" id="text-1-3-2-2">
<p>
Need to make sure to validate that the user is an admin
</p>
</div>
<ol class="org-ol">
<li><a id="org60ae9a2"></a>Assets<br />
<ol class="org-ol">
<li><a id="orgaecd7b6"></a>DynamoDB:<br />
<ol class="org-ol">
<li><a id="org1abf2f1"></a>Read:<br />
<div class="outline-text-8" id="text-1-3-2-2-1-1-1">
<ul class="org-ul">
<li>tokens-table(validation isUser)</li>
<li>users-table(validation isAdmin)</li>
</ul>
</div>
</li>
<li><a id="org25ca33a"></a>Write:<br />
<div class="outline-text-8" id="text-1-3-2-2-1-1-2">
<ul class="org-ul">
<li>assignments-table</li>
</ul>
<div class="org-src-container">
<pre class="src src-javascript">{
  "assignmentId": {GENERATED},
  "assignmentName": $assignmentName,
  "deadline": $deadline,
  "score": $scoreBreakdown
}
// call params, base64 encoded
{
 "token": "251",
  "assignmentName": "Linked Lists",
  "deadline": "2018-12-02 11:59",
  "deploymentPackage": "I2luY2x1ZGUgPHN0ZGlvLmg+CiNpbmNsdWRlIDxzdGRsaWIuaD4KCmludCBtYWluKCl7CiAgIHByaW50ZigiSGVsbG8gV29ybGQhXG4iKTsKICAgcmV0dXJuIDA7Cn0K",
  "scoreBreakdown": {
   "score": 100,
   "scoreBreakdown": {
     "some_field": 100,
     "other_field": 100,
     "my_field": 100,
     "field": 100,
     "feld": 100
     }
   }
}
</pre>
</div>
</div>
</li>
</ol>
</li>
<li><a id="org4547e21"></a>S3:<br />
<ol class="org-ol">
<li><a id="org8da4e0f"></a>Read:<br /></li>
<li><a id="orgcf92778"></a>Write:<br />
<div class="outline-text-8" id="text-1-3-2-2-1-2-2">
<ul class="org-ul">
<li>documents-bucket/{assignments-table[assignmentId]}/deploymentPackage.zip</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
<li><a id="org9ebd369"></a>[PRIVATE] enterScore(assetId, assignmentId, score, scoreBreakdown)<br />
<div class="outline-text-5" id="text-1-3-2-3">
<p>
Writes a score in for the submission.
</p>
</div>
<ol class="org-ol">
<li><a id="orgd278753"></a>Assets<br />
<ol class="org-ol">
<li><a id="orgcfaf68e"></a>DynamoDB:<br />
<ol class="org-ol">
<li><a id="orgb6f9298"></a>Read:<br /></li>
<li><a id="org76614c3"></a>Write:<br />
<div class="outline-text-8" id="text-1-3-2-3-1-1-2">
<ul class="org-ul">
<li>submissions-table</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>

<div id="outline-container-org5f8e71c" class="outline-4">
<h4 id="org5f8e71c"><span class="section-number-4">1.3.3</span> Modify Scoreboard</h4>
<div class="outline-text-4" id="text-1-3-3">
</div>
<ol class="org-ol">
<li><a id="orgf25de1d"></a>[PRIVATE] updateScoreboard(netid, assetId, assignmentId)<br />
<ol class="org-ol">
<li><a id="orga997292"></a>Trigger: submissions-table dynamodb stream[MODIFY]<br />
<div class="outline-text-6" id="text-1-3-3-1-1">
<p>
When the submissions-table is modified,
 if the $SUBMISSION.state is 'SCORED', then
   if the $SUBMISSION.score is larger than the current scoreboard submission for getTokenId($SUBMISSION.netid)
     replace current scoreboard entry with tokenizedSubmission($ENTRY)
</p>

<p>
its the highest of 
</p>
</div>
</li>
<li><a id="org5b5a421"></a>Assets<br />
<ol class="org-ol">
<li><a id="org811ba96"></a>DynamoDB:<br />
<ol class="org-ol">
<li><a id="orgb326db2"></a>Read:<br />
<div class="outline-text-8" id="text-1-3-3-1-2-1-1">
<ul class="org-ul">
<li>submissions-table</li>
</ul>
</div>
</li>
<li><a id="orge4a305e"></a>Write:<br />
<div class="outline-text-8" id="text-1-3-3-1-2-1-2">
<ul class="org-ul">
<li>scoreboard-table</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>

<div id="outline-container-org264d706" class="outline-4">
<h4 id="org264d706"><span class="section-number-4">1.3.4</span> Modify Assignment</h4>
<div class="outline-text-4" id="text-1-3-4">
</div>
<ol class="org-ol">
<li><a id="org71212da"></a>[PROTECTED][ADMIN] changeDeadline(token, assignmentId, deadline)<br />
<div class="outline-text-5" id="text-1-3-4-1">
<p>
What if it's being extended after it's due?
</p>
</div>
<ol class="org-ol">
<li><a id="org008d5aa"></a>Assets<br />
<ol class="org-ol">
<li><a id="org84630b8"></a>DynamoDB:<br />
<ol class="org-ol">
<li><a id="orgc29e98e"></a>Read:<br />
<div class="outline-text-8" id="text-1-3-4-1-1-1-1">
<ul class="org-ul">
<li>tokens-table</li>
<li>users-table</li>
</ul>
</div>
</li>
<li><a id="orge08e54a"></a>Write:<br />
<div class="outline-text-8" id="text-1-3-4-1-1-1-2">
<ul class="org-ul">
<li>assignments-table</li>
</ul>
<div class="org-src-container">
<pre class="src src-javascript">{
  "assignmentId": assignmentId,
  "deadline": $deadline
}
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
<li><a id="org5d9c8dc"></a>[FUTURE] <code>[PROTECTED][ADMIN] changeScoring(token, assignmentId, scoreBreakdown)</code><br />
<div class="outline-text-5" id="text-1-3-4-2">
<p>
     ot my prNoblem if the rubric is broken
     his may Trequire a change of the deployment package
*****Assets   
</p>
</div>
<ol class="org-ol">
<li><a id="orge9610a2"></a>DynamoD*B:<br />
<ol class="org-ol">
<li><a id="org5608910"></a>Read: *<br />
<div class="outline-text-7" id="text-1-3-4-2-1-1">
<ul class="org-ul">
<li>token s-table</li>
<li>users -table</li>
</ul>
</div>
</li>
<li><a id="orgbee9639"></a>Write:*<br />
<div class="outline-text-7" id="text-1-3-4-2-1-2">
<ul class="org-ul">
<li>assig nments-table</li>
</ul>
<p>
+BEGIN<sub>S</sub>#RC javascript
        {
 "assign mentId": assignmentId,
 "deadli ne": $deadline
        }
+END<sub>SRC</sub>#
</p>
</div>
</li>
</ol>
</li>
</ol>
</li>

<li><a id="orgf28c6e7"></a>[FUTURE] <code>[PROTECTED][ADMIN] changeDeploymentPackage(token, assignmentId, deploymentPackage)</code><br />
<div class="outline-text-5" id="text-1-3-4-3">
<p>
Not my problem if the deployment package is broken. This is a future reach goal
This may require a change of the scoring
</p>
</div>
<ol class="org-ol">
<li><a id="org080eac2"></a>Assets<br />
<ol class="org-ol">
<li><a id="orgbb1116e"></a>DynamoDB:<br />
<ol class="org-ol">
<li><a id="org7e79ec1"></a>Read:<br />
<div class="outline-text-8" id="text-1-3-4-3-1-1-1">
<ul class="org-ul">
<li>tokens-table(validate isUser)</li>
<li>users-table(validate isAdmin)</li>
</ul>
</div>
</li>
