docs.org
**** [PROTECTED] getUser(token) -> user
     get user's credentials
     this will be used to determine if the session token is legitimate
     returns {} if invalid
***** Assets
****** DynamoDB:
******* Read:
       - tokens-table
       - users-table
******* Write:
*** Grading Workflow
**** [PRIVATE][SECRET] quarantine(bool, instance-id)
     Set quarantine on the calling asset...
     This endpoint/function is essentially the sudo button that we have to hide
***** Assets
****** EC2:
******* Read:
******* Write:
        - attach-role to instance
        - detach-role from instance

** Library Utilities
   We use environment variables since they are consistent given that we use terraform to provision
*** [LOCAL] getNetId(token) -> string
***** Assets
****** DynamoDB:
******* Read:
       - tokens-table
******* Write:
*** [LOCAL] getTokenId(netid) -> string
    getTokenId by retrieving the tokenizedId of this user
**** Constraints:
     Tokenizing by hashing the netid and uin fails since the netid is public information 
     and the uin is within 100,000,000, so it takes 100,000,000 local guesses to brute 
     force 1 user's token.
     Due to this, I've decided to assign tokens by hashing the time that they first logged in 
     and some salt if necessary
***** Assets
****** DynamoDB:
******* Read:
       - users-table
******* Write:
*** [LOCAL] isOwner(token, assetId, assignmentId)
***** Assets
****** DynamoDB:
******* Read:
       - tokens-table
       - users-table
       - submissions-table
******* Write:
*** [LOCAL] isAdmin(token)
***** Assets
****** DynamoDB:
******* Read:
       - tokens-table
       - users-table
******* Write:
*** [LOCAL][PRIVATE] insertDynamoDB(tablename, object) -> bool
    This is going to be extremely common
#+BEGIN_SRC python
def insertDynamoDB(tablename, json):
  client = boto3.client('dynamodb')
  table_name = os.environ[endpoint]
  # TODO
#+END_SRC
*** [LOCAL][PRIVATE] retrieveDynamoDB(tablename, object) -> bool
    returns {} if successful else None
#+BEGIN_SRC python
def retrieveDynamoDB(tablename, json):
  client = boto3.client('dynamodb')
  table_name = os.environ[endpoint]
  # TODO
#+END_SRC
** Callable APIs
*** =Auth=
**** [PUBLIC] login(authorizationCode) -> bearerToken
**** [PROTECTED] logout(token) -> null
*** =Create=
**** [PROTECTED] submitAssignment(token, assignmentId, asset)
**** [PROTECTED] createAssignment(token, assignmentName, deploymentPackage, deadline, scoreBreakdown)
*** =Modify Assignment=
**** [PROTECTED] changeDeadline(token, assignmentId, deadline)
**** [PROTECTED] changeScoring(token, assignmentId, scoreBreakdown)
**** [PROTECTED] changeDeploymentPackage(token, assignmentId, deploymentPackage)
*** =Query=
**** [PROTECTED] getSubmissions(token, assignmentId) -> [submission, ...]
**** [PROTECTED] getScoreboard(token, assignmentId) -> [tokenizedSubmission, ...]
**** [PROTECTED] getAssignments(token) -> [assignment, ...]
**** [PROTECTED] getUser(token) -> user
** Todolist
*** [1/1] APIs
***** DONE [PUBLIC] login(authorizationCode) -> bearerToken
*** [1/1] API Gateway
***** DONE [PUBLIC] login(authorizationCode) -> bearerToken
* Frontend
** Frames
*** Scoreboard
**** API calls
***** getScoreboard(token, assignmentId)
*** My Submissions
**** API calls
***** getSubmissions(token, assignmentId)
*** Admin Interface
