docs.html
<li><a id="org00cc4f3"></a>Write:<br /></li>
</ol>
</li>
<li><a id="org0bfc488"></a>S3:<br />
<ol class="org-ol">
<li><a id="orgf9dad88"></a>Read:<br /></li>
<li><a id="org993db1c"></a>Write:<br />
<div class="outline-text-8" id="text-1-3-4-3-1-2-2">
<ul class="org-ul">
<li>documents-bucket/{assignments-table[assignmentId]}/deploymentPackage.zip</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>

<div id="outline-container-org0bb6d59" class="outline-4">
<h4 id="org0bb6d59"><span class="section-number-4">1.3.5</span> Query Database</h4>
<div class="outline-text-4" id="text-1-3-5">
</div>
<ol class="org-ol">
<li><a id="org2b48814"></a>[PROTECTED] getSubmissions(token, assignmentId) -&gt; [submission, &#x2026;]<br />
<ol class="org-ol">
<li><a id="orgaed4550"></a>Assets<br />
<ol class="org-ol">
<li><a id="orga161bcf"></a>DynamoDB:<br />
<ol class="org-ol">
<li><a id="org97ee2db"></a>Read:<br />
<div class="outline-text-8" id="text-1-3-5-1-1-1-1">
<ul class="org-ul">
<li>tokens-table</li>
<li>assignments-table(validate)</li>
<li>submissions-table</li>
</ul>
</div>
</li>
<li><a id="org39ee976"></a>Write:<br /></li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
<li><a id="orga852a58"></a>[PROTECTED] getScoreboard(token, assignmentId) -&gt; [tokenizedSubmission, &#x2026;]<br />
<ol class="org-ol">
<li><a id="orgea783d3"></a>Assets<br />
<ol class="org-ol">
<li><a id="org2d1ac12"></a>DynamoDB:<br />
<ol class="org-ol">
<li><a id="orgf73cfee"></a>Read:<br />
<div class="outline-text-8" id="text-1-3-5-2-1-1-1">
<ul class="org-ul">
<li>tokens-table</li>
<li>assignments-table</li>
<li>scoreboard-table</li>
</ul>
</div>
</li>
<li><a id="org7d87c03"></a>Write:<br /></li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
<li><a id="org7abbe0f"></a>[PROTECTED] getAssignments(token) -&gt; [assignment, &#x2026;]<br />
<ol class="org-ol">
<li><a id="org7fe16f2"></a>Assets<br />
<ol class="org-ol">
<li><a id="org7a9112c"></a>DynamoDB:<br />
<ol class="org-ol">
<li><a id="org00337df"></a>Read:<br />
<div class="outline-text-8" id="text-1-3-5-3-1-1-1">
<ul class="org-ul">
<li>tokens-table</li>
<li>assignments-table</li>
</ul>
</div>
</li>
<li><a id="orge901a49"></a>Write:<br /></li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
<li><a id="orgc578656"></a>[PROTECTED] getUser(token) -&gt; user<br />
<div class="outline-text-5" id="text-1-3-5-4">
<p>
get user's credentials
this will be used to determine if the session token is legitimate
returns {} if invalid
</p>
</div>
<ol class="org-ol">
<li><a id="org31abd43"></a>Assets<br />
<ol class="org-ol">
<li><a id="org18fd34b"></a>DynamoDB:<br />
<ol class="org-ol">
<li><a id="org9a5acb5"></a>Read:<br />
<div class="outline-text-8" id="text-1-3-5-4-1-1-1">
<ul class="org-ul">
<li>tokens-table</li>
<li>users-table</li>
</ul>
</div>
</li>
<li><a id="org09524c0"></a>Write:<br /></li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org25017c4" class="outline-4">
<h4 id="org25017c4"><span class="section-number-4">1.3.6</span> Grading Workflow</h4>
<div class="outline-text-4" id="text-1-3-6">
</div>
<ol class="org-ol">
<li><a id="org6250fbe"></a>[PRIVATE][SECRET] quarantine(bool, instance-id)<br />
<div class="outline-text-5" id="text-1-3-6-1">
<p>
Set quarantine on the calling asset&#x2026;
This endpoint/function is essentially the sudo button that we have to hide
</p>
</div>
<ol class="org-ol">
<li><a id="orga46ff1c"></a>Assets<br />
<ol class="org-ol">
<li><a id="org4a45338"></a>EC2:<br />
<ol class="org-ol">
<li><a id="org794d40d"></a>Read:<br /></li>
<li><a id="org377a04b"></a>Write:<br />
<div class="outline-text-8" id="text-1-3-6-1-1-1-2">
<ul class="org-ul">
<li>attach-role to instance</li>
<li>detach-role from instance</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-org73c302b" class="outline-3">
<h3 id="org73c302b"><span class="section-number-3">1.4</span> Library Utilities</h3>
<div class="outline-text-3" id="text-1-4">
<p>
We use environment variables since they are consistent given that we use terraform to provision
</p>
</div>
<div id="outline-container-org8bb3f2e" class="outline-4">
<h4 id="org8bb3f2e"><span class="section-number-4">1.4.1</span> [LOCAL] getNetId(token) -&gt; string</h4>
<div class="outline-text-4" id="text-1-4-1">
</div>
<ol class="org-ol">
<li><a id="org99d41f8"></a>Assets<br />
<ol class="org-ol">
<li><a id="org232a8c3"></a>DynamoDB:<br />
<ol class="org-ol">
<li><a id="org083fa3e"></a>Read:<br />
<div class="outline-text-8" id="text-1-4-1-0-1-1-1">
<ul class="org-ul">
<li>tokens-table</li>
</ul>
</div>
</li>
<li><a id="org82ff2c0"></a>Write:<br /></li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgda2f89e" class="outline-4">
<h4 id="orgda2f89e"><span class="section-number-4">1.4.2</span> [LOCAL] getTokenId(netid) -&gt; string</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
getTokenId by retrieving the tokenizedId of this user
</p>
</div>
<ol class="org-ol">
<li><a id="orge03627e"></a>Constraints:<br />
<div class="outline-text-5" id="text-1-4-2-1">
<p>
Tokenizing by hashing the netid and uin fails since the netid is public information 
and the uin is within 100,000,000, so it takes 100,000,000 local guesses to brute 
force 1 user's token.
Due to this, I've decided to assign tokens by hashing the time that they first logged in 
and some salt if necessary
</p>
</div>
<ol class="org-ol">
<li><a id="org60dbd8b"></a>Assets<br />
<ol class="org-ol">
<li><a id="org93afc98"></a>DynamoDB:<br />
<ol class="org-ol">
<li><a id="orgf76fa89"></a>Read:<br />
<div class="outline-text-8" id="text-1-4-2-1-1-1-1">
<ul class="org-ul">
<li>users-table</li>
</ul>
</div>
</li>
<li><a id="org074e1d8"></a>Write:<br /></li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgb8b4a4a" class="outline-4">
<h4 id="orgb8b4a4a"><span class="section-number-4">1.4.3</span> [LOCAL] isOwner(token, assetId, assignmentId)</h4>
<div class="outline-text-4" id="text-1-4-3">
</div>
<ol class="org-ol">
<li><a id="org910f341"></a>Assets<br />
<ol class="org-ol">
<li><a id="orgb2ac578"></a>DynamoDB:<br />
<ol class="org-ol">
<li><a id="orgecafdc4"></a>Read:<br />
<div class="outline-text-8" id="text-1-4-3-0-1-1-1">
<ul class="org-ul">
<li>tokens-table</li>
<li>users-table</li>
<li>submissions-table</li>
</ul>
</div>
</li>
<li><a id="orgec22675"></a>Write:<br /></li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgdc436b3" class="outline-4">
<h4 id="orgdc436b3"><span class="section-number-4">1.4.4</span> [LOCAL] isAdmin(token)</h4>
<div class="outline-text-4" id="text-1-4-4">
</div>
<ol class="org-ol">
<li><a id="orgaf17898"></a>Assets<br />
<ol class="org-ol">
<li><a id="orgc119e32"></a>DynamoDB:<br />
<ol class="org-ol">
<li><a id="orgf4be5dc"></a>Read:<br />
<div class="outline-text-8" id="text-1-4-4-0-1-1-1">
<ul class="org-ul">
<li>tokens-table</li>
<li>users-table</li>
</ul>
</div>
</li>
<li><a id="orgf640c8a"></a>Write:<br /></li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgec95d0b" class="outline-4">
<h4 id="orgec95d0b"><span class="section-number-4">1.4.5</span> [LOCAL][PRIVATE] insertDynamoDB(tablename, object) -&gt; bool</h4>
<div class="outline-text-4" id="text-1-4-5">
<p>
This is going to be extremely common
</p>
<div class="org-src-container">
<pre class="src src-python">def insertDynamoDB(tablename, json):
  client = boto3.client('dynamodb')
  table_name = os.environ[endpoint]
  # TODO
</pre>
</div>
</div>
</div>
<div id="outline-container-org7a3f1dc" class="outline-4">
<h4 id="org7a3f1dc"><span class="section-number-4">1.4.6</span> [LOCAL][PRIVATE] retrieveDynamoDB(tablename, object) -&gt; bool</h4>
<div class="outline-text-4" id="text-1-4-6">
<p>
returns {} if successful else None
</p>
<div class="org-src-container">
<pre class="src src-python">def retrieveDynamoDB(tablename, json):
  client = boto3.client('dynamodb')
  table_name = os.environ[endpoint]
  # TODO
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9013af8" class="outline-3">
<h3 id="org9013af8"><span class="section-number-3">1.5</span> Callable APIs</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-orgf9ba56d" class="outline-4">
<h4 id="orgf9ba56d"><span class="section-number-4">1.5.1</span> <code>Auth</code></h4>
<div class="outline-text-4" id="text-1-5-1">
</div>
<ol class="org-ol">
<li><a id="orgb007607"></a>[PUBLIC] login(authorizationCode) -&gt; bearerToken<br /></li>
<li><a id="org2b6cb31"></a>[PROTECTED] logout(token) -&gt; null<br /></li>
</ol>
</div>
<div id="outline-container-org0426a41" class="outline-4">
<h4 id="org0426a41"><span class="section-number-4">1.5.2</span> <code>Create</code></h4>
<div class="outline-text-4" id="text-1-5-2">
</div>
<ol class="org-ol">
<li><a id="orgd9d726d"></a>[PROTECTED] submitAssignment(token, assignmentId, asset)<br /></li>
<li><a id="org574e7f1"></a>[PROTECTED] createAssignment(token, assignmentName, deploymentPackage, deadline, scoreBreakdown)<br /></li>
</ol>
</div>
<div id="outline-container-orge2ff2ac" class="outline-4">
<h4 id="orge2ff2ac"><span class="section-number-4">1.5.3</span> <code>Modify Assignment</code></h4>
<div class="outline-text-4" id="text-1-5-3">
</div>
<ol class="org-ol">
<li><a id="orgf6555aa"></a>[PROTECTED] changeDeadline(token, assignmentId, deadline)<br /></li>
<li><a id="org7d623bf"></a>[PROTECTED] changeScoring(token, assignmentId, scoreBreakdown)<br /></li>
<li><a id="org3a3600c"></a>[PROTECTED] changeDeploymentPackage(token, assignmentId, deploymentPackage)<br /></li>
</ol>
</div>
<div id="outline-container-org243dbe2" class="outline-4">
<h4 id="org243dbe2"><span class="section-number-4">1.5.4</span> <code>Query</code></h4>
<div class="outline-text-4" id="text-1-5-4">
</div>
<ol class="org-ol">
<li><a id="orge972d18"></a>[PROTECTED] getSubmissions(token, assignmentId) -&gt; [submission, &#x2026;]<br /></li>
<li><a id="org6ebd939"></a>[PROTECTED] getScoreboard(token, assignmentId) -&gt; [tokenizedSubmission, &#x2026;]<br /></li>
<li><a id="org04bfa77"></a>[PROTECTED] getAssignments(token) -&gt; [assignment, &#x2026;]<br /></li>
<li><a id="org0453077"></a>[PROTECTED] getUser(token) -&gt; user<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org12c369b" class="outline-3">
<h3 id="org12c369b"><span class="section-number-3">1.6</span> Todolist</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-org1e5f27f" class="outline-4">
<h4 id="org1e5f27f"><span class="section-number-4">1.6.1</span> <code>[1/1]</code> APIs</h4>
<div class="outline-text-4" id="text-1-6-1">
</div>
<ol class="org-ol">
<li><a id="org4b3d61e"></a><span class="done DONE">DONE</span> [PUBLIC] login(authorizationCode) -&gt; bearerToken<br /></li>
</ol>
</div>
<div id="outline-container-org8afb539" class="outline-4">
<h4 id="org8afb539"><span class="section-number-4">1.6.2</span> <code>[1/1]</code> API Gateway</h4>
<div class="outline-text-4" id="text-1-6-2">
</div>
<ol class="org-ol">
<li><a id="org064d02e"></a><span class="done DONE">DONE</span> [PUBLIC] login(authorizationCode) -&gt; bearerToken<br /></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orga55df00" class="outline-2">
<h2 id="orga55df00"><span class="section-number-2">2</span> Frontend</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org05a6174" class="outline-3">
<h3 id="org05a6174"><span class="section-number-3">2.1</span> Frames</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgba599fa" class="outline-4">
<h4 id="orgba599fa"><span class="section-number-4">2.1.1</span> Scoreboard</h4>
<div class="outline-text-4" id="text-2-1-1">
</div>
<ol class="org-ol">
<li><a id="orgb1d0c12"></a>API calls<br />
<ol class="org-ol">
<li><a id="org3a16b5c"></a>getScoreboard(token, assignmentId)<br /></li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org84338f6" class="outline-4">
<h4 id="org84338f6"><span class="section-number-4">2.1.2</span> My Submissions</h4>
<div class="outline-text-4" id="text-2-1-2">
</div>
<ol class="org-ol">
<li><a id="orgb495746"></a>API calls<br />
<ol class="org-ol">
<li><a id="org7bc2cc5"></a>getSubmissions(token, assignmentId)<br /></li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgfbd5540" class="outline-4">
<h4 id="orgfbd5540"><span class="section-number-4">2.1.3</span> Admin Interface</h4>
<div class="outline-text-4" id="text-2-1-3">
</div>
<ol class="org-ol">
