docs.org
**** Build an interface to create assignments
*** User Information
**** API calls
***** getUser(token)
** Storage
*** S3
**** frontend-assets-bucket
** Actions
*** Submit Assignment
**** API calls
***** submitAssignment(token, assignmentId, asset)
*** Create Assignment
**** API calls
***** submitAssignment(token, assignmentId, asset)
*** Select Assignment
    Changes currently selected item
    Refreshes currently selected menu
*** Log out
**** API calls
***** logout(token)
** TODO Provisioning
*** S3 Bucket
    frontend-assets-bucket
*** AutoScaling group + Elastic Load Balancer
*** Instance Template
**** userdata to pull code and start node webserver
* Grading Workflow
** Security
  This is the largest security hazard that we have to deal with.
*** Permissions:
    The grading resource needs access to the following(either directly or indirectly):
    - S3
    - DynamoDB
    - SQS
*** User Classes:
**** Instructor
***** Read
****** Local Filesystem
***** Write
****** Local Filesystem
**** Student
     No access
*** Mitigations:
**** Monitoring
     Monitor abnormally large files. Possibly a CloudWatch event pushing to an SNS notification.
**** OS Permissions
    - All code is run as a non-privileged user
**** Firewall
    - Remove internet gateway to prevent data exfiltration
**** IAM Roles
    - Invoke lambdas to assign and remove necessary permissions from the box as it needs them.
      Reduce the AWS permissions that the box has access to as the non privileged user runs 
      his code and return them in privileged mode.
**** [PRIVATE][SECRET] quarantine(bool, instance-id)
    Set quarantine on the calling asset...
    This endpoint/function is essentially the sudo button that we have to hide
** Constraints
   1 grading job at a time per instance, due to quarantine race conditions.
** Grading AMI
   In order to perform our security role in this manner, we must provide features
*** gcc
*** python
*** make
** Filesystem Layout
*** Environment
    /deploy/quarantine.py
    /deploy/cloudgrade.sh
    /deploy/uploadScores.py
    /deploy/package.zip -> /deploy/package/
*** DeploymentPackage.zip format
   package/
   package/deploy.sh -> 
     should generate:
       package/score.json
** [PRIVATE][ABSTRACT] gradingWorkflow(netid, assignmentId, assetId)
   This grading workflow is run on a kubernetes cluster with docker containers running nodejs fetching jobs
   from an AWS SQS queue. TODO have to make it so if a machine keels over, the asset still gets graded.
   
*** Custom grading AMI
    In order to avoid extensive instructor permission, we will be using custom grading amis
    #+BEGIN_SRC bash
    build assets:
    - gcc
    - g++
    - make
    - gnu coreutils
    grading assets:
    - aws-cli
    - python
    - python-boto3
    users:
    - user #unprivileged user
    #+END_SRC
*** FETCH step
    #+BEGIN_SRC javascript
    const endpoints = configuration-table['HARDCODED-CRN']; // TODO Generalize
    const submissionsTable = endpoints['submissions-table'];
    const documentsBucket = endpoints['documents-bucket'];
    const gradingQueue = endpoints['grading-queue'];
     
    // to get job information
    const job = gradingQueue.retrieveJob()
    gradingQueue.sendReceipt()
    /*
    // job:
     {
       "netid": "$netid",
       "assignmentId": "$assignmentId",
       "assetId": "$assetId"
     }
    */

    const submission = submissionsTable[assetId];
    const deployPackage = 'documents-bucket/' + submissions-table[assetId].assignmentId + '/deployPackage.zip'
    const asset = 'documents-bucket/' + submissions-table[assetId].assignmentId + '/' + submission.assetId;
    retrieveAssets(deployPackage); // downloads the testing package
    retrieveAssets(asset); // downloads the asset to be evaluated
    executeGradingScript('/deploy/cloudgrade.sh', job) // kicks off the grading script to generate ./package/score.json and then will call a script to upload the scores
    // job is not private data
    // SHELL CMDLINE arguments are visible to users
    #+END_SRC
*** EXECUTE step
    #+BEGIN_SRC bash
    #!/bin/bash
    #filename: /deploy/cloudgrade.sh
    # STORE ENDPOINTS
    cd /deploy/
    # set ./deploy/package owner to user
    # will cause this package to get reaped after upload
    chgrp user ./package -R
    chown user ./package -R
    chmod 700 ./package -R

    cd ./package
    sudo -u user ./deploy.sh
    cd /deploy

    # "/deploy/package/score.json" contains the score that should match the scoreBreakdown object
    ./uploadScores.py "$1" "$(cat ./package/score.json)"

    # clean up all files by user to maintain the clean state
    find / -user 'user' -exec rm -fr {} \;

    exit
    #+END_SRC
