docs.html
<li><a id="org31f880d"></a>Build an interface to create assignments<br /></li>
</ol>
</div>
<div id="outline-container-orgb62ab41" class="outline-4">
<h4 id="orgb62ab41"><span class="section-number-4">2.1.4</span> User Information</h4>
<div class="outline-text-4" id="text-2-1-4">
</div>
<ol class="org-ol">
<li><a id="org0a83ed5"></a>API calls<br />
<ol class="org-ol">
<li><a id="org45f683d"></a>getUser(token)<br /></li>
</ol>
</li>
</ol>
</div>
</div>
<div id="outline-container-org0a97480" class="outline-3">
<h3 id="org0a97480"><span class="section-number-3">2.2</span> Storage</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org5f16623" class="outline-4">
<h4 id="org5f16623"><span class="section-number-4">2.2.1</span> S3</h4>
<div class="outline-text-4" id="text-2-2-1">
</div>
<ol class="org-ol">
<li><a id="orgefc23bc"></a>frontend-assets-bucket<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org08f1d3e" class="outline-3">
<h3 id="org08f1d3e"><span class="section-number-3">2.3</span> Actions</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org6caee06" class="outline-4">
<h4 id="org6caee06"><span class="section-number-4">2.3.1</span> Submit Assignment</h4>
<div class="outline-text-4" id="text-2-3-1">
</div>
<ol class="org-ol">
<li><a id="org94cb119"></a>API calls<br />
<ol class="org-ol">
<li><a id="orgaf1e834"></a>submitAssignment(token, assignmentId, asset)<br /></li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgf1eaba2" class="outline-4">
<h4 id="orgf1eaba2"><span class="section-number-4">2.3.2</span> Create Assignment</h4>
<div class="outline-text-4" id="text-2-3-2">
</div>
<ol class="org-ol">
<li><a id="orgf76c843"></a>API calls<br />
<ol class="org-ol">
<li><a id="orga4fe29f"></a>submitAssignment(token, assignmentId, asset)<br /></li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org4368f35" class="outline-4">
<h4 id="org4368f35"><span class="section-number-4">2.3.3</span> Select Assignment</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
Changes currently selected item
Refreshes currently selected menu
</p>
</div>
</div>
<div id="outline-container-org60f7e26" class="outline-4">
<h4 id="org60f7e26"><span class="section-number-4">2.3.4</span> Log out</h4>
<div class="outline-text-4" id="text-2-3-4">
</div>
<ol class="org-ol">
<li><a id="orgd1361cf"></a>API calls<br />
<ol class="org-ol">
<li><a id="org5d98f1a"></a>logout(token)<br /></li>
</ol>
</li>
</ol>
</div>
</div>
<div id="outline-container-org990af30" class="outline-3">
<h3 id="org990af30"><span class="section-number-3">2.4</span> <span class="todo TODO">TODO</span> Provisioning</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-orgb4e9502" class="outline-4">
<h4 id="orgb4e9502"><span class="section-number-4">2.4.1</span> S3 Bucket</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
frontend-assets-bucket
</p>
</div>
</div>
<div id="outline-container-org1ef0f81" class="outline-4">
<h4 id="org1ef0f81"><span class="section-number-4">2.4.2</span> AutoScaling group + Elastic Load Balancer</h4>
</div>
<div id="outline-container-org7231a47" class="outline-4">
<h4 id="org7231a47"><span class="section-number-4">2.4.3</span> Instance Template</h4>
<div class="outline-text-4" id="text-2-4-3">
</div>
<ol class="org-ol">
<li><a id="org9e7c55c"></a>userdata to pull code and start node webserver<br /></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org38bbbc1" class="outline-2">
<h2 id="org38bbbc1"><span class="section-number-2">3</span> Grading Workflow</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org131198b" class="outline-3">
<h3 id="org131198b"><span class="section-number-3">3.1</span> Security</h3>
<div class="outline-text-3" id="text-3-1">
<p>
This is the largest security hazard that we have to deal with.
</p>
</div>
<div id="outline-container-org3b54a0b" class="outline-4">
<h4 id="org3b54a0b"><span class="section-number-4">3.1.1</span> Permissions:</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
The grading resource needs access to the following(either directly or indirectly):
</p>
<ul class="org-ul">
<li>S3</li>
<li>DynamoDB</li>
<li>SQS</li>
</ul>
</div>
</div>
<div id="outline-container-orgab732ee" class="outline-4">
<h4 id="orgab732ee"><span class="section-number-4">3.1.2</span> User Classes:</h4>
<div class="outline-text-4" id="text-3-1-2">
</div>
<ol class="org-ol">
<li><a id="org91c650a"></a>Instructor<br />
<ol class="org-ol">
<li><a id="org07eb048"></a>Read<br />
<ol class="org-ol">
<li><a id="org087367b"></a>Local Filesystem<br /></li>
</ol>
</li>
<li><a id="org2f18bea"></a>Write<br />
<ol class="org-ol">
<li><a id="orga33cc22"></a>Local Filesystem<br /></li>
</ol>
</li>
</ol>
</li>
<li><a id="org859b78c"></a>Student<br />
<div class="outline-text-5" id="text-3-1-2-2">
<p>
No access
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org84f7c0b" class="outline-4">
<h4 id="org84f7c0b"><span class="section-number-4">3.1.3</span> Mitigations:</h4>
<div class="outline-text-4" id="text-3-1-3">
</div>
<ol class="org-ol">
<li><a id="org086376b"></a>Monitoring<br />
<div class="outline-text-5" id="text-3-1-3-1">
<p>
Monitor abnormally large files. Possibly a CloudWatch event pushing to an SNS notification.
</p>
</div>
</li>
<li><a id="org52fcc1a"></a>OS Permissions<br />
<div class="outline-text-5" id="text-3-1-3-2">
<ul class="org-ul">
<li>All code is run as a non-privileged user</li>
</ul>
</div>
</li>
<li><a id="org9b57f03"></a>Firewall<br />
<div class="outline-text-5" id="text-3-1-3-3">
<ul class="org-ul">
<li>Remove internet gateway to prevent data exfiltration</li>
</ul>
</div>
</li>
<li><a id="org8afac55"></a>IAM Roles<br />
<div class="outline-text-5" id="text-3-1-3-4">
<ul class="org-ul">
<li>Invoke lambdas to assign and remove necessary permissions from the box as it needs them.
Reduce the AWS permissions that the box has access to as the non privileged user runs 
his code and return them in privileged mode.</li>
</ul>
</div>
</li>
<li><a id="orge3cb33e"></a>[PRIVATE][SECRET] quarantine(bool, instance-id)<br />
<div class="outline-text-5" id="text-3-1-3-5">
<p>
Set quarantine on the calling asset&#x2026;
This endpoint/function is essentially the sudo button that we have to hide
</p>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-org008da22" class="outline-3">
<h3 id="org008da22"><span class="section-number-3">3.2</span> Constraints</h3>
<div class="outline-text-3" id="text-3-2">
<p>
1 grading job at a time per instance, due to quarantine race conditions.
</p>
</div>
</div>
<div id="outline-container-org2a9fe19" class="outline-3">
<h3 id="org2a9fe19"><span class="section-number-3">3.3</span> Grading AMI</h3>
<div class="outline-text-3" id="text-3-3">
<p>
In order to perform our security role in this manner, we must provide features
</p>
</div>
<div id="outline-container-org2a9ac08" class="outline-4">
<h4 id="org2a9ac08"><span class="section-number-4">3.3.1</span> gcc</h4>
</div>
<div id="outline-container-org446923b" class="outline-4">
<h4 id="org446923b"><span class="section-number-4">3.3.2</span> python</h4>
</div>
<div id="outline-container-orgc2857d5" class="outline-4">
<h4 id="orgc2857d5"><span class="section-number-4">3.3.3</span> make</h4>
</div>
</div>
<div id="outline-container-org1a000dd" class="outline-3">
<h3 id="org1a000dd"><span class="section-number-3">3.4</span> Filesystem Layout</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-orgc54d31c" class="outline-4">
<h4 id="orgc54d31c"><span class="section-number-4">3.4.1</span> Environment</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
/deploy/quarantine.py
/deploy/cloudgrade.sh
<i>deploy/uploadScores.py
/deploy/package.zip -&gt; /deploy/package</i>
</p>
</div>
</div>
<div id="outline-container-orgcccfed0" class="outline-4">
<h4 id="orgcccfed0"><span class="section-number-4">3.4.2</span> DeploymentPackage.zip format</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
package/
package/deploy.sh -&gt; 
  should generate:
    package/score.json
</p>
</div>
</div>
</div>
<div id="outline-container-org98562a3" class="outline-3">
<h3 id="org98562a3"><span class="section-number-3">3.5</span> [PRIVATE][ABSTRACT] gradingWorkflow(netid, assignmentId, assetId)</h3>
<div class="outline-text-3" id="text-3-5">
<p>
This grading workflow is run on a kubernetes cluster with docker containers running nodejs fetching jobs
from an AWS SQS queue. TODO have to make it so if a machine keels over, the asset still gets graded.
</p>
</div>

<div id="outline-container-org7c0c86b" class="outline-4">
<h4 id="org7c0c86b"><span class="section-number-4">3.5.1</span> Custom grading AMI</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
In order to avoid extensive instructor permission, we will be using custom grading amis
</p>
<div class="org-src-container">
<pre class="src src-bash">build assets:
- gcc
- g++
- make
- gnu coreutils
grading assets:
- aws-cli
- python
- python-boto3
users:
- user #unprivileged user
</pre>
</div>
</div>
</div>
<div id="outline-container-org8b455f1" class="outline-4">
<h4 id="org8b455f1"><span class="section-number-4">3.5.2</span> FETCH step</h4>
<div class="outline-text-4" id="text-3-5-2">
<div class="org-src-container">
<pre class="src src-javascript">const endpoints = configuration-table['HARDCODED-CRN']; // TODO Generalize
const submissionsTable = endpoints['submissions-table'];
const documentsBucket = endpoints['documents-bucket'];
const gradingQueue = endpoints['grading-queue'];

// to get job information
const job = gradingQueue.retrieveJob()
gradingQueue.sendReceipt()
/*
// job:
 {
   "netid": "$netid",
   "assignmentId": "$assignmentId",
   "assetId": "$assetId"
 }
*/

const submission = submissionsTable[assetId];
const deployPackage = 'documents-bucket/' + submissions-table[assetId].assignmentId + '/deployPackage.zip'
const asset = 'documents-bucket/' + submissions-table[assetId].assignmentId + '/' + submission.assetId;
retrieveAssets(deployPackage); // downloads the testing package
retrieveAssets(asset); // downloads the asset to be evaluated
executeGradingScript('/deploy/cloudgrade.sh', job) // kicks off the grading script to generate ./package/score.json and then will call a script to upload the scores
// job is not private data
// SHELL CMDLINE arguments are visible to users
</pre>
</div>
</div>
</div>
<div id="outline-container-org899230a" class="outline-4">
<h4 id="org899230a"><span class="section-number-4">3.5.3</span> EXECUTE step</h4>
<div class="outline-text-4" id="text-3-5-3">
<div class="org-src-container">
<pre class="src src-bash">#!/bin/bash
#filename: /deploy/cloudgrade.sh
# STORE ENDPOINTS
cd /deploy/
# set ./deploy/package owner to user
# will cause this package to get reaped after upload
chgrp user ./package -R
chown user ./package -R
chmod 700 ./package -R

cd ./package
sudo -u user ./deploy.sh
cd /deploy

# "/deploy/package/score.json" contains the score that should match the scoreBreakdown object
./uploadScores.py "$1" "$(cat ./package/score.json)"

# clean up all files by user to maintain the clean state
find / -user 'user' -exec rm -fr {} \;

exit
</pre>
</div>
</div>
</div>
