docs.org
*** WRITEBACK step
**** uploadScores.py(job, score)
     submissionsTableEndpoint is required and can be retrieved from the configuration-table
     insert the score and scoreBreakdown and 'SCORED' into the submissions-table[assetId]
    #+BEGIN_SRC javascript
    // package/score.json
    {
      "score": 100,
      "scoreBreakdown": {
        // these are user defined and are up to the user to keep coherent
        "some_field": 100,
        "other_field": 100,
        "my_field": 100,
        "field": 100,
        "feld": 100
      }
    }
    #+END_SRC
** TODO Todolist
*** DONE Provisioning
**** Grading AMI
**** Subnet
**** Instance Template
***** Security Groups
**** AutoScaling group + Elastic Load Balancer
**** [0/2] IAM roles
***** TODO [EC2] Quarantine Invoke Role
***** TODO [EC2] UnQuarantined Role
*** DONE Grading AMI
*** DONE [EXAMPLE]DeploymentPackage.zip
*** DONE retrieveAssets.py
*** DONE quarantine.py
*** DONE cloudgrade.sh
*** DONE uploadScores.py
*** TODO Monitoring CloudWatch Events
* [1/1] Knowledge Gaps
- [X] OAuth implementation
* Reach Goals
** Hidden Assignments for DEV/Prototyping
** Deleting Assignments
** Using user data to populate scripts into Grading Workflow Instance Template
*** Makes it more modular and faster to update scripts
** [0/3] Reach Goals
*** TODO [PROTECTED] changeScoring(token, assignmentId, scoreBreakdown)
*** TODO [PROTECTED] changeDeploymentPackage(token, assignmentId, deploymentPackage)
*** TODO [UNNECESSARY][PROTECTED] continueSession(token) -> bool

