docs.html
<div id="outline-container-org1e84273" class="outline-4">
<h4 id="org1e84273"><span class="section-number-4">3.5.4</span> WRITEBACK step</h4>
<div class="outline-text-4" id="text-3-5-4">
</div>
<ol class="org-ol">
<li><a id="orgc2ec5b6"></a>uploadScores.py(job, score)<br />
<div class="outline-text-5" id="text-3-5-4-1">
<p>
submissionsTableEndpoint is required and can be retrieved from the configuration-table
insert the score and scoreBreakdown and 'SCORED' into the submissions-table[assetId]
</p>
<div class="org-src-container">
<pre class="src src-javascript">// package/score.json
{
  "score": 100,
  "scoreBreakdown": {
    // these are user defined and are up to the user to keep coherent
    "some_field": 100,
    "other_field": 100,
    "my_field": 100,
    "field": 100,
    "feld": 100
  }
}
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orgc36fed9" class="outline-3">
<h3 id="orgc36fed9"><span class="section-number-3">3.6</span> <span class="todo TODO">TODO</span> Todolist</h3>
<div class="outline-text-3" id="text-3-6">
</div>
<div id="outline-container-org04d6c13" class="outline-4">
<h4 id="org04d6c13"><span class="section-number-4">3.6.1</span> <span class="done DONE">DONE</span> Provisioning</h4>
<div class="outline-text-4" id="text-3-6-1">
</div>
<ol class="org-ol">
<li><a id="orga94cb6e"></a>Grading AMI<br /></li>
<li><a id="org99f10ea"></a>Subnet<br /></li>
<li><a id="orga021951"></a>Instance Template<br />
<ol class="org-ol">
<li><a id="org3d654ee"></a>Security Groups<br /></li>
</ol>
</li>
<li><a id="orgab98873"></a>AutoScaling group + Elastic Load Balancer<br /></li>
<li><a id="org58561b9"></a><code>[0/2]</code> IAM roles<br />
<ol class="org-ol">
<li><a id="org009fdaa"></a><span class="todo TODO">TODO</span> [EC2] Quarantine Invoke Role<br /></li>
<li><a id="org0a05b17"></a><span class="todo TODO">TODO</span> [EC2] UnQuarantined Role<br /></li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgf8c2871" class="outline-4">
<h4 id="orgf8c2871"><span class="section-number-4">3.6.2</span> <span class="done DONE">DONE</span> Grading AMI</h4>
</div>
<div id="outline-container-org179ffc7" class="outline-4">
<h4 id="org179ffc7"><span class="section-number-4">3.6.3</span> <span class="done DONE">DONE</span> [EXAMPLE]DeploymentPackage.zip</h4>
</div>
<div id="outline-container-org0fad855" class="outline-4">
<h4 id="org0fad855"><span class="section-number-4">3.6.4</span> <span class="done DONE">DONE</span> retrieveAssets.py</h4>
</div>
<div id="outline-container-orgd31fa57" class="outline-4">
<h4 id="orgd31fa57"><span class="section-number-4">3.6.5</span> <span class="done DONE">DONE</span> quarantine.py</h4>
</div>
<div id="outline-container-org8d81b7d" class="outline-4">
<h4 id="org8d81b7d"><span class="section-number-4">3.6.6</span> <span class="done DONE">DONE</span> cloudgrade.sh</h4>
</div>
<div id="outline-container-org698bc57" class="outline-4">
<h4 id="org698bc57"><span class="section-number-4">3.6.7</span> <span class="done DONE">DONE</span> uploadScores.py</h4>
</div>
<div id="outline-container-org42e0792" class="outline-4">
<h4 id="org42e0792"><span class="section-number-4">3.6.8</span> <span class="todo TODO">TODO</span> Monitoring CloudWatch Events</h4>
</div>
</div>
</div>
<div id="outline-container-orgf5fd1f5" class="outline-2">
<h2 id="orgf5fd1f5"><span class="section-number-2">4</span> <code>[1/1]</code> Knowledge Gaps</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li class="on"><code>[X]</code> OAuth implementation</li>
</ul>
</div>
</div>
<div id="outline-container-orge78ad18" class="outline-2">
<h2 id="orge78ad18"><span class="section-number-2">5</span> Reach Goals</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgcd06a0b" class="outline-3">
<h3 id="orgcd06a0b"><span class="section-number-3">5.1</span> Hidden Assignments for DEV/Prototyping</h3>
</div>
<div id="outline-container-org8ac9d9e" class="outline-3">
<h3 id="org8ac9d9e"><span class="section-number-3">5.2</span> Deleting Assignments</h3>
</div>
<div id="outline-container-org1b1be3b" class="outline-3">
<h3 id="org1b1be3b"><span class="section-number-3">5.3</span> Using user data to populate scripts into Grading Workflow Instance Template</h3>
<div class="outline-text-3" id="text-5-3">
</div>
<div id="outline-container-org78dbd8a" class="outline-4">
<h4 id="org78dbd8a"><span class="section-number-4">5.3.1</span> Makes it more modular and faster to update scripts</h4>
</div>
</div>
<div id="outline-container-org464c410" class="outline-3">
<h3 id="org464c410"><span class="section-number-3">5.4</span> <code>[0/3]</code> Reach Goals</h3>
<div class="outline-text-3" id="text-5-4">
</div>
<div id="outline-container-org260c700" class="outline-4">
<h4 id="org260c700"><span class="section-number-4">5.4.1</span> <span class="todo TODO">TODO</span> [PROTECTED] changeScoring(token, assignmentId, scoreBreakdown)</h4>
</div>
<div id="outline-container-org12c2991" class="outline-4">
<h4 id="org12c2991"><span class="section-number-4">5.4.2</span> <span class="todo TODO">TODO</span> [PROTECTED] changeDeploymentPackage(token, assignmentId, deploymentPackage)</h4>
</div>
<div id="outline-container-org5df9267" class="outline-4">
<h4 id="org5df9267"><span class="section-number-4">5.4.3</span> <span class="todo TODO">TODO</span> [UNNECESSARY][PROTECTED] continueSession(token) -&gt; bool</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kyle Dixler</p>
<p class="date">Created: 2019-01-31 Thu 08:56</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
